{"doc_id": 164117, "author": "wbogacz", "text": "Google is making it easier, as reported today, to change the country to a different one. From Android Police on 2018/03/20: Now, Google appears to be taking one teeny tiny step toward making the switch easier for some people. If your Play Store country is set to country A (whether you lived there or, uhm, fooled Google into thinking you did because you made a purchase with a valid payment method and to a valid shipping address in that country), and the Play Store detects that youve moved to country B (likely based on your IP address), youll get a new option in the Account settings: Country and profiles. There youll see which country your Store account is on and an option to quickly switch to the new country - provided you have a valid payment method there. There are some caveats to this: Keep in mind that this Country and profiles option wont be there for everyone and wont let you switch to any country you want. It appears to only show up when it detects a discrepancy between your setting and your IP address."}
{"doc_id": 33053, "author": "James Fernandes", "text": "You can always try the Matrox DualHead2Go Digital ME. I use the Mini DisplayPort version and it works well except it can get quite fussy when I try to resume from sleep. Of course, Im using it with the MBP lid closed; it doesnt seem to have this problem when the lid is open. One other note: the device makes both monitors appear to the Mac as being a single, giant monitor. However, I havent really had any issue with this myself."}
{"doc_id": 196895, "author": "Dan", "text": "For all intents and purposes, CentOS is RedHat. CentOS, however is more flexible in what they can do. From the CentOS website: CentOS is developed by a small but growing team of core developers. In turn the core developers are supported by an active user community including system administrators, network administrators, enterprise users, managers, core Linux contributors and Linux enthusiasts from around the world. CentOS has numerous advantages over some of the other clone projects including: an active and growing user community, quickly rebuilt, tested, and QAed errata packages, an extensive mirror network, developers who are contactable and responsive, multiple free support avenues including IRC Chat, Mailing Lists, Forums, a dynamic FAQ. In a nutshell, CentOS is a community version of RedHat. You use Ubuntu, so you may understand this analogy a bit better: CentOS is to RedHat as Linux Mint is to Ubuntu."}
{"doc_id": 393511, "author": "blucz", "text": "If a developer showed up at an interview with a bunch of certifications on his resume, I would develop serious doubts as to his value system. There are zero situations in which Id value time spent obtaining a certification over time spent working on a project. Any project."}
{"doc_id": 557356, "author": "Lighty", "text": "Long answer: According to Microsoft, Winmail.dat is a file that keeps the rich-text formatting readable if sent by Outlook. I have sniffed around a bit and found out that attachments that act like the way Winmail.dat does exist. Then again, since its an attachment (and I hope you dont auto-open attachments from emails), you should only open it if you trust the person that send it to you, or have a good anti-virus that can scan your mail too. Short answer: yes, attachment malware called winmail.dat exists, exploitation of a valid file is possible, because it basically contains theming. More info on winmail.dat can be found on this website: http://support.microsoft.com/kb/278061"}
{"doc_id": 196908, "author": "pradeepchhetri", "text": "You can get this working by using: TEST=foo && echo $TEST"}
{"doc_id": 304, "author": "g .", "text": "⌘+⇧+N: Create a new folder in Finder"}
{"doc_id": 196913, "author": "gertvdijk", "text": "Use netstat. For example $ netstat -nputw Active Internet connections (w/o servers) Proto Recv-Q Send-Q Local Address Foreign Address State PID/Program name [...] tcp 0 0 192.168.25.222:22 192.168.0.134:42903 ESTABLISHED 32663/sshd: gert [p lists all UDP (u), TCP (t) and RAW (w) outgoing connections (not using l or a) in a numeric form (n, prevents possible long-running DNS queries) and includes the program (p) associated with that. Consider adding the c option to get output being updated continuously."}
{"doc_id": 305, "author": "Tobias Cohen", "text": "⌘+⇥: Cycle through running apps ⌘+`: Cycle through windows for current app ⌘+W: Close current window ⌘+Q: Quit current app ⌘+,: Preferences dialog for current app ⌘+H: Hide current app (as long as its not Photoshop) ctrl+⇧+⏏: Sleep all displays"}
{"doc_id": 196915, "author": "Kratos", "text": "netstat is a good option.Use the parameters as required.(see its man pages) For example netstat -antup Here it can monitor all(a) listening numeric (n) tcp (t) and udp (u) process (p). You can also try the ss command . For reference use : SS Linux TCP / UDP Network and Socket Information"}
