{"question": "why igp is used in mpls?", "response": "An IGP exchanges routing prefixes between gateways/routers.  \nWithout a routing protocol, you'd have to configure each route on every router and you'd have no dynamic updates when routes change because of link failures. \nFuthermore, within an MPLS network, an IGP is vital for advertising the internal topology and ensuring connectivity for MP-BGP inside the network.", "gold_doc_ids": [2822, 2823]}
{"question": "how do you achieve a numeric versioning scheme with git?", "response": "Take a look at the process of using 'git-describe' by way of GIT-VERSION-GEN and how you can add this via your build process when you tag your release. \nFor guidance, can also refer to the provided blog at http://cd34.com/blog/programming/using-git-to-generate-an-automatic-version-number/.", "gold_doc_ids": [3965]}
{"question": "why are my text messages coming up as maybe?", "response": "This is part of the Proactivity features new with iOS 9: It looks at info in emails to see if anyone with this number sent you an email and if it finds the phone number associated with a contact from your email, it will show you \"Maybe\". \n\nHowever, it has been suggested there is a bug in iOS 11.2 that can result in \"Maybe\" being displayed even when \"Find Contacts in Other Apps\" is disabled.", "gold_doc_ids": [3956, 3957, 8034]}
{"question": "what is the difference between man and help in linux?", "response": "\"Help\" is a Bash built-in command designed to provide assistance specifically for Bash commands, whereas \"man\" (manual) is a conventional way to get help for nearly all system commands and, occasionally, configuration files.", "gold_doc_ids": [4383]}
{"question": "chroot jail - what is it and how do i use it?", "response": "A chroot jail is a way to isolate a process that does not run as a root and its children from the rest of the system; you must create a directory tree where you copy or link in all the system files needed for a process to run.", "gold_doc_ids": [1388]}
{"question": "are there any famous one-man-army programmers?", "response": "Bill Joy is notable for writing vi, among other programs, including csh, rlogin, rsh, and rcp.  \nChris Sawyer was instrumental in creating RollerCoaster Tycoon, contributing to the game's programming, which included a physics engine, and writing it in assembly language.  \nOren Eini, also known as Ayende Rahien, is the author behind Rhino Mocks and is known for writing elegant code.  \nGuido van Rossum created Python.  \nRichard M. Stallman, often referred to as RMS, created Emacs and gcc and is recognized for maintaining pace with commercial Lisp machine code.  \nThe first version of Lisp can be attributed to John McCarthy.  \nJamie Zawinski is associated with one of computer science's most epic stories.  \nDerek Smart was known for his involvement with Battlecruiser 3000AD and his penchant for flame wars.  \nSteve Wozniak was essentially Apple's early programming staff.  \nJohn Carmack created the engines for several iconic games, including the Doom, Wolfenstein and Quake series.  \nAda Lovelace is celebrated as a pioneering figure in computing history.  \nKhaled Mardam-Bey is the author of the popular IRC client, mIRC.  \nThe invention and first implementation of C++ is credited to Bjarne Stroustrup.  \nJon Van Caneghem single-handedly wrote, designed, and developed the original Might and Magic game, with some assistance for artwork, Dan Bunten created M.U.L.E., Seven Cities of Gold and a variety of other games, and Bill Budge - Created Pinball Construction Set, alongside many other games, from scratch, by himself.  \nShaun Inman is recognized as a solo developer.  \nAndrew Braybrook, Archer MacLean, Martin Walker, Jon Hare/Chris Yates, and Stavros Fasoulas are remembered for their individual contributions to Commodore 64 games, often doing everything themselves, including coding, sound, music, and graphics.  \nLarry Wall is known for creating Perl.  \nMatthew Smith is credited with writing Manic Miner and Jet Set Willy by himself.  \nApple Writer was among Paul Lutus' creations.  \nRichard Greenblatt has made significant contributions at the MIT AI Lab, including developing a chess program and Lisp Machine.  \nWayne Ratliff, the creator behind the dBASE software, coded it in assembler.  \nNick Bradbury is notable for developing HomeSite, TopStyle, and FeedDemon, paying great attention to user feedback.  \nHighlights in programming language development include John Backus with Fortran, Stephen Wolfram for the Mathematica package, Tim Berners-Lee - inventor of World Wide Web and Phil Zimmermann - PGP.  \nChuck Moore achieved recognition for creating Forth, as well as designing microprocessors and securing hardware patents.  \nSimon Tatham wrote the widely used SSH client, PuTTY.  \nAnders Hejlsberg is the creator behind Turbo Pascal, Delphi, and C#. \nCleve Moler is known for originating MATLAB.  \nBram Cohen's project contributes significantly to internet traffic.  \nMarkus Frind is the CEO of Plentyoffish.com, which he created alone, and the site generates significant revenue.  \nJonathan Blow single-handedly developed the game Braid, including its sophisticated audio and particle systems. \nD.J. Bernstein is remembered for qmail, djbdns, and his legal challenge enabling the publication of cryptography tools on the internet.  \nCharles Babbage conceptualized the idea of a programmable computer.  \nPhil Katz developed the important file compression utility PKZip.  \nGary Kildall created CP/M, an early operating system.  \nFabrice Bellard is recognized for writing FFmpeg, leading the QEMU project, discovering fast algorithms for calculating pi and FFmpeg and qemu, .  \nThe hacker dark_alex falls into the one-man-army category.  \nSlava Pestov created the advanced programming language Factor and developed Jedit at a young age.  \nJon Tackabury's contributions come from Binary Fortress.  \nDoug Cutting initiated the creation of Lucene, Nutch, and later Hadoop.  \nContributions by Eugene Roshal include the FAR file manager, RAR file format, and WinRAR file archiver, while Mark Zuckerberg created Facebook.  \nRich Hickey authored Clojure.  \nScawen Roberts, recognized for his work on the game Live for Speed, has been programming it single-handedly for years.  \nOgre3D, an object-oriented graphics rendering engine, was created by Steve Streeting.  \nJim Kent's coding efforts were pivotal in the public release of the Human Genome Project's map.  \nAmong renowned hackers, Eric Corley and Kevin Mitnick are acknowledged.  \nWayne Venables allegedly wrote Fruitshow forum software in 3 hours.  \nArthur Whitney developed the \"K\" programming language and implemented a compact SQL engine in it.  \nThe creators of the Leisure Suit Larry series, SimCity, and Elite are Al Lowe, Will Wright, and David Braben, respectively.  \njQuery, a popular JavaScript framework, was created by John Resig.  \nThe original FruityLoops software was developed by Didier Dambrin using Delphi.  \nSid Meier Co-founded Microprose and wrote Sid Meier's Alpha Centauri, and Sid Meier's Colonization, Sid Meier's Civilization IV.  \nWalter Bright worked solo on Digital Mars' C++ compiler for several years and initiated the D language.  \nShawn Fanning is the creator behind Napster.  \nThe creation of the Spring framework is attributable to Rod Johnson.  \nPeldi Guilizzoni developed Balsamiq, a tool for creating mockups.  \nNasir Gebelli stands out for his early Apple II games like Gorgon and Space Eggs.  \nThe near entirety of VIM was written by Bram Moolenaar.  \nSimon Peyton Jones is known for his research in functional programming and for authoring the Glasgow Haskell Compiler.  \nWil Shipley's work includes Delicious Library.  \nJoe Hewitt created Firebug and DOM Inspector.  \nKernighan, Ritchie, and others like James Clark and Audrey Tang have made notable contributions.  \nDonald Knuth and Ken Thompson are mentioned for their influence on programming.  \nKen Silverman developed the Build engine for video games.  \nJohn Carmack, Dave Cutler, and others like Tim Sweeney are highlighted for major contributions to software and operating systems.  \nPaul Lutus is acknowledged as the father of Apple Writer.  \nPeter Blum developed a comprehensive collection of ASP.NET controls.  \nMatt Mullenweg created influential web development tools like WordPress.  \nGus Mueller is recognized for his work.  \nAlan Turing, the father of modern computer science, is mentioned for his contributions.  \nJordan Mechner programmed the original Prince of Persia games, and the animations were based on his brother's movements.  \nD. Richard Hipp is known for SQLite and other TCL/TK-related work.  \nMike Pall wrote LuaJIT, while Julian Seward created bzip2 and Valgrind.  \nMarkus Persson, also known as Notch, is known for developing Minecraft.  \nBill Atkinson wrote MacPaint for the original Macintosh.  \nAgain, Nick Bradbury is acknowledged for creating HomeSite, TopStyle, and FeedDemon.  \nAvery Lee developed Virtualdub, and Gabest was involved with Media Player Classic.  \nJeff Minter, long-time video game programmer, created Tempest 3000 in assembler.  \nAustin Meyer is credited with developing X-Plane.  \nJustin Frankel created Winamp and Gnutella.  \nMarkus Persson single-handedly worked on the design, programming, and graphics of Minecraft.  \nDave Cutler was the father of VMS and NT and significantly contributed to Windows Azure.  \nEddie Kohler is recognized for the Click modular router.  \nL. Peter Deutsch is recognized for Ghostscript and other works.  \nCharles Simonyi (Microsoft Word and Excel),  Joe Armstrong (Erlang) and Bertrand Meyer (Eiffel).  \nIvan Sutherland's invention of Sketchpad is a significant milestone.  \nCave Story, a game created by Daisuke Amaya, also known as Pixel, is celebrated.  \nAllan Odgaard is the author of TextMate.  \nJeff Atwood is credited with creating the platform used for these discussions.  \nDan Bricklin, inventor of the electronic spreadsheet, and Richard Bartle, for inventing MUD, are recognized for their pioneering work.  \nAndrew Tridgell developed rsync & samba.", "gold_doc_ids": [3638, 3639, 3640, 3641, 3642, 3643, 3644, 3645, 3646, 3648, 3649, 3650, 3651, 3653, 3654, 3655, 3656, 3657, 3659, 3660, 3661, 3662, 3663, 3664, 3665, 3666, 3667, 3669, 3670, 3671, 3672, 3673, 3674, 3676, 3677, 3678, 3680, 3681, 3682, 3683, 3684, 3685, 3686, 3687, 3688, 3689, 3690, 3693, 3694, 3695, 3696, 3697, 3698, 3701, 3702, 3704, 3705, 3706, 3707, 3708, 3709, 3710, 3711, 3712, 3713, 3714, 3715, 3716, 3717, 3718, 3719, 3721, 3722, 3723, 3724, 3725, 3726, 3727, 3728, 3729, 3730, 3731, 3732, 3733, 3735, 3736, 3737, 3738, 3740, 3744]}
{"question": "how do i disable the minimize (command-m) shortcut in mavericks?", "response": "To disable the Minimize (Command-M) shortcut in Mavericks, one approach is to install a key remapper, such as KeyRemap4MacBook. \nAlternatively, you can adjust settings directly without additional software by going to System Preferences > Keyboard > Shortcuts > App Shortcuts and assigning a less likely-to-be-used combination for the \"Minimize\" and \"Minimize All\" functions.  \nIn macOS 10.12 (Sierra), setting the CMD-M mapping to a different action works right away: the method involves going to System Preferences > Keyboard > Shortcuts > App Shortcuts, checking off the Show Help Menu item, and assigning it a Command-M key combination. \nIf you're using Karabiner with High Sierra or higher, you can create a configuration file to customize shortcuts.", "gold_doc_ids": [3130, 4189, 6811, 1697]}
{"question": "how can i move files and view the progress (e.g. with a progress bar)?", "response": "In order to build a patched cp and mv, you can create versions that support the -g switch to show progress available online 9`$ sudo cp src/cp /usr/bin/cp $ sudo cp src/mv /usr/bin/mv `), but one user prefers `$ sudo cp src/cp /usr/local/bin/cpg $ sudo cp src/mv /usr/local/bin/mvg` because it doesn't overwrite coreutils or break scripts in case of a problem.  \nRsync is another tool that can copy files with a progress bar when using the -P switch, so if you have rsync installed and you could use a simple alias in your shell's dotfile: `alias cp='rsync -aP'` or `rsync -aP --remove-source-files $src $dst && rm -r $src` and you can use a shell script to create a progress bar during file copying.  \nThe latest version of rsync has an alternate flag `--info=progress2` that shows progress for the entire operation.  \nThe pipe viewer command pv allows you to show a progress bar when copying files, as does Midnight Commander (mc).  \nA tool named progress can find descriptors related to running commands to show progress and speed (`progress -w` outputs the stats for all running cp,mv etc. operations).  \nGcp (Goffi's CoPier) offers an alternative method to add a progress bar without patching core utilities.  \nOn Mint, you can use gcp (gcp SOURCE DESTINATION) or curl to transfer files with progress information.  \nBy sending a SIGINFO to mv using CTRL-T, you will send a SIGINFO to mv, and can then get a report on the progress of the transfer.  \nPv is another tool you can use to print progress based on line count or file count (You will need pipe viewer: http://www.ivarch.com/programs/pv.shtml mv -v sourcedir targetdir | pv -l -s filecount > logfile ) and combined with mv -v, it can give progress updates, use `find sourcedir | wc -l` to get file count.  \nSimply checking the size of the directory (`du -hs /directory/you're/moving/data/to`) can provide a way to monitor progress.  \nFinally, bash script `#!/usr/bin/env bash rsync -aP --remove-source-files \"$@\" && rm -rf \"${@:1:$#-1}\"` handles more then one source and filenames with whitespaces: `$ rsmv source1 source2 source\\ 3 \"source 4\" dest`.", "gold_doc_ids": [1795, 1796, 3880, 6805, 448, 3896, 4546, 1823, 5459, 8432, 6950, 1036]}
{"question": "how do i delete photos from my ipad but not icloud?", "response": "If you have iCloud Photo Library turned on, all of your devices' camera rolls are identical so, unfortunately, you cannot delete photos from your iPad, but not iCloud.  \n\nYou can turn off iCloud Photo Library on a single device by following these steps: on your iPad, go to Settings > iCloud > Photos and turn off iCloud Photo Library, which will delete your photos from your iPad, but not your iPhone or iCloud account.", "gold_doc_ids": [4244]}
{"question": "can i make a song from itunes my ringtone?", "response": "Yes, if you create a version no longer than 30 seconds in iTunes first, change the file name from .m4a to .m4r, then import it as ringtone, which you can then sync to your iPhone.", "gold_doc_ids": [2664]}
